Repository: testpress/cortex
Catalog: packages/core/lib/l10n/app_*.arb
Languages: ar, ml

# appTitle
source: Cortex SDK
ar: كورتيكس SDK
ml: കോട്ടെക്സ് SDK

# loginButton
source: Login
ar: تسجيل الدخول
ml: ലോഗിൻ

# welcomeMessage
source: Welcome to Cortex
ar: مرحبًا بك في كورتيكس
ml: കോട്ടെക്സിലേക്ക് സ്വാഗതം

# courseLibraryTitle
source: Cortex
ar: كورتيكس
ml: കോട്ടെക്സ്

# courseLibrarySubtitle
source: Course Library
ar: مكتبة الدورات
ml: കോഴ്സ് ലൈബ്രറി

# course_1_title
source: Flutter Fundamentals
ar: أساسيات فلاتر
ml: ഫ്ലട്ടർ അടിസ്ഥാനങ്ങൾ

# course_1_description
source: Master the basics of Flutter development with hands-on projects and real-world examples.
ar: أتقن أساسيات تطوير فلاتر من خلال مشاريع عملية وأمثلة واقعية.
ml: പ്രോജക്റ്റുകളിലൂടെയും ഉദാഹരണങ്ങളിലൂടെയും ഫ്ലട്ടർ വികസനത്തിന്റെ അടിസ്ഥാന കാര്യങ്ങൾ പഠിക്കുക.

# course_2_title
source: Advanced State Management
ar: إدارة الحالة المتقدمة
ml: അഡ്വാൻസ്ഡ് സ്റ്റേറ്റ് മാനേജ്‌മെന്റ്

# course_2_description
source: Deep dive into state management patterns including Provider, Riverpod, and Bloc.
ar: تعمق في أنماط إدارة الحالة بما في ذلك Provider و Riverpod و Bloc.
ml: പ്രൊവൈഡർ, റിവർപോഡ്, ബ്ലോക്ക് തുടങ്ങിയ സ്റ്റേറ്റ് മാനേജ്‌മെന്റ് പാറ്റേണുകളെക്കുറിച്ച് ആഴത്തിൽ പഠിക്കുക.

# course_3_title
source: Custom Animations
ar: الرسوم المتحركة المخصصة
ml: കസ്റ്റം ആനിമേഷനുകൾ

# course_3_description
source: Create stunning animations and transitions using Flutter's animation framework.
ar: قم بإنشاء رسوم متحركة وانتقالات مذهلة باستخدام إطار عمل الرسوم المتحركة في فلاتر.
ml: ഫ്ലട്ടറിന്റെ ആനിമേഷൻ ചട്ടക്കൂട് ഉപയോഗിച്ച് ആകർഷകമായ ആനിമേഷനുകൾ നിർമ്മിക്കുക.

# course_4_title
source: Firebase Integration
ar: تكامل فايربيز
ml: ഫയർബേസ് സംയോജനം

# course_4_description
source: Build production-ready apps with Firebase authentication, Firestore, and cloud functions.
ar: قم ببناء تطبيقات جاهزة للإنتاج باستخدام Firebase authentication و Firestore و cloud functions.
ml: ഫയർബേസ് ഓതന്റിക്കേഷൻ, ഫയർസ്റ്റോർ എന്നിവ ഉപയോഗിച്ച് ആപ്പുകൾ നിർമ്മിക്കുക.

# course_5_title
source: Testing Strategies
ar: استراتيجيات الاختبار
ml: ടെസ്റ്റിംഗ് സ്ട്രാറ്റജികൾ

# course_5_description
source: Write comprehensive unit, widget, and integration tests for bulletproof Flutter apps.
ar: اكتب اختبارات وحدة وويجيت وتكامل شاملة لتطبيقات فلاتر مضادة للرصاص.
ml: യൂണിറ്റ്, വിജറ്റ്, ഇന്റഗ്രേഷൻ ടെസ്റ്റുകൾ എങ്ങനെ എഴുതാമെന്ന് പഠിക്കുക.

# course_6_title
source: Performance Optimization
ar: تحسين الأداء
ml: പെർഫോമൻസ് ഓപ്റ്റിമൈസേഷൻ

# course_6_description
source: Optimize your Flutter apps for smooth 60fps performance on all devices.
ar: قم بتحسين تطبيقات فلاتر الخاصة بك للحصول على أداء سلس بمعدل 60 إطارًا في الثانية على جميع الأجهزة.
ml: എല്ലാ ഉപകരണങ്ങളിലും മികച്ച രീതിയിൽ പ്രവർത്തിക്കുന്നതിനായി നിങ്ങളുടെ ആപ്പുകൾ ഒപ്റ്റിമൈസ് ചെയ്യുക.

# labelStart
source: Start
ar: ابدأ
ml: തുടങ്ങുക

# labelContinue
source: Continue
ar: استمر
ml: തുടരുക

# labelProgress
source: Progress
ar: تقدم
ml: പുരോഗതി

# labelCourseProgress
source: Course progress
ar: تقدم الدورة
ml: കോഴ്സിന്റെ പുരോഗതി
